#### TextEditorOptions Members

---

|  |
| --- |
| TextEditorOptions Class   Methods   Properties   See Also |

The  TextEditorOptions  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  TextEditorOptions |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method Static member | GetTextEditorOptions | Returns the current Revit instance's TextEditorOptions. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | ShowBorder | Show the border box around the text during editing. |
| Public property | ShowOpaqueBackground | Show opaque background behind the text during editing. |

# See Also

TextEditorOptions Class

Autodesk.Revit.UI Namespace